Hello @rnosal 

This error is not produced by Terraform. Instead it is returned by MAAS itself. I would like you to collect the MAAS logs during the time of 504 to understand the root cause. As for the Terraform part, you could enable the debug logs to reveal what Terraform is doing behind the scenes.

As for what Terraform is doing; it first creates the machine and then every 10 seconds is querying MAAS for its status. This stops after 20 minutes, the [default](https://developer.hashicorp.com/terraform/plugin/sdkv2/resources/retries-and-customizable-timeouts#default-timeouts-and-deadline-exceeded-errors) timeout, or it can be extended with custom timeout for `maas_machine` create: https://registry.terraform.io/providers/canonical/maas/latest/docs/resources/machine#create-1

This is an example output with a dummy VM:

```bash
$ export TF_LOG=debug
$ terraform apply -auto-approve
...
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_machine.lxd_vm will be created
  + resource "maas_machine" "lxd_vm" {
      + architecture       = "amd64/generic"
      + domain             = (known after apply)
      + hostname           = (known after apply)
      + id                 = (known after apply)
      + min_hwe_kernel     = (known after apply)
      + network_interfaces = (known after apply)
      + pool               = (known after apply)
      + power_parameters   = (sensitive value)
      + power_type         = "lxd"
      + pxe_mac_address    = "00:16:3e:a9:a9:08"
      + zone               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
...
...
maas_machine.lxd_vm: Creating...
2025-03-20T10:43:41.838+0200 [INFO]  Starting apply for maas_machine.lxd_vm
2025-03-20T10:43:41.839+0200 [DEBUG] maas_machine.lxd_vm: applying the planned Create change
2025-03-20T10:43:41.840+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:41 [DEBUG] setting computed for "network_interfaces" from ComputedKeys: timestamp="2025-03-20T10:43:41.840+0200"
2025-03-20T10:43:44.527+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:44 [DEBUG] Waiting for machine (ad63xh) status to be one of [Ready]: timestamp="2025-03-20T10:43:44.527+0200"
2025-03-20T10:43:44.527+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:44 [DEBUG] Waiting for state to become: [Ready]: timestamp="2025-03-20T10:43:44.527+0200"
maas_machine.lxd_vm: Still creating... [10s elapsed]
2025-03-20T10:43:54.636+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:54 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:43:54.636+0200"
2025-03-20T10:43:54.636+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:54 [TRACE] Waiting 3s before next try: timestamp="2025-03-20T10:43:54.636+0200"
2025-03-20T10:43:57.774+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:57 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:43:57.774+0200"
2025-03-20T10:43:57.774+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:43:57 [TRACE] Waiting 6s before next try: timestamp="2025-03-20T10:43:57.774+0200"
maas_machine.lxd_vm: Still creating... [20s elapsed]
2025-03-20T10:44:03.907+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:03 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:03.907+0200"
2025-03-20T10:44:03.907+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:03 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:03.907+0200"
maas_machine.lxd_vm: Still creating... [30s elapsed]
2025-03-20T10:44:14.048+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:14 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:14.048+0200"
2025-03-20T10:44:14.048+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:14 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:14.048+0200"
maas_machine.lxd_vm: Still creating... [40s elapsed]
2025-03-20T10:44:24.229+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:24 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:24.228+0200"
2025-03-20T10:44:24.229+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:24 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:24.229+0200"
maas_machine.lxd_vm: Still creating... [50s elapsed]
2025-03-20T10:44:34.380+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:34 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:34.380+0200"
2025-03-20T10:44:34.380+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:34 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:34.380+0200"
maas_machine.lxd_vm: Still creating... [1m0s elapsed]
2025-03-20T10:44:44.509+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:44 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:44.509+0200"
2025-03-20T10:44:44.509+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:44 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:44.509+0200"
maas_machine.lxd_vm: Still creating... [1m10s elapsed]
2025-03-20T10:44:54.695+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:54 [DEBUG] Machine (ad63xh) status: Commissioning: timestamp="2025-03-20T10:44:54.694+0200"
2025-03-20T10:44:54.695+0200 [INFO]  provider.terraform-provider-maas_v2.4.0: 2025/03/20 10:44:54 [TRACE] Waiting 10s before next try: timestamp="2025-03-20T10:44:54.694+0200"
```

 At the same time this is a portion of the journal logs of MAAS that contains the HTTP calls made by Terraform:

```
Mar 20 08:43:44 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:43:44 +0000] "POST /MAAS/api/2.0/machines/?op= HTTP/1.1" 200 5259 "-" "Go-http-client/1.1"
Mar 20 08:43:54 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:43:54 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:43:57 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:43:57 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:03 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:03 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:14 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:14 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:24 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:24 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:34 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:34 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:44 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:44 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
Mar 20 08:44:54 maas-dev maas-http[1019]:  10.20.0.1 - - [20/Mar/2025:08:44:54 +0000] "GET /MAAS/api/2.0/machines/ad63xh/ HTTP/1.1" 200 8133 "-" "Go-http-client/1.1"
```